In [1]:
import pandas

In [2]:
import pandas as pd

In [3]:
# pandas : func1, func2, func3, var1, var2, var3
# f = pd.func1

In [4]:
# csv, excel, json, ...

In [5]:
# players = 'Krunal', 'Hardik', 'Pollard'
# runs = 15, 23, 47

In [6]:
pd.DataFrame({'players': ['Krunal', 'Hardik', 'Pollard'], 'runs':[15, 23, 47]})

   players  runs
0   Krunal    15
1   Hardik    23
2  Pollard    47

In [7]:
pd.DataFrame({'players': ['Krunal', 'Hardik', 'Pollard'], 'runs':[15, 23, 47], 'balls':[10, 20, 17]})

   players  runs  balls
0   Krunal    15     10
1   Hardik    23     20
2  Pollard    47     17

In [8]:
df = pd.DataFrame({'players': ['Krunal', 'Hardik', 'Pollard'], 'runs':[15, 23, 47], 'balls':[10, 20, 17]})

In [9]:
df

   players  runs  balls
0   Krunal    15     10
1   Hardik    23     20
2  Pollard    47     17

In [ ]:
# How many runs did a player score?
# How many runs did Pollard score?

In [10]:
df['players']

0     Krunal
1     Hardik
2    Pollard
Name: players, dtype: object

In [12]:
df['balls']

0    10
1    20
2    17
Name: balls, dtype: int64

In [15]:
df[['players', 'runs']]

   players  runs
0   Krunal    15
1   Hardik    23
2  Pollard    47

In [18]:
cols_list = ['players', 'runs']
cols_list_2 = ['runs', 'balls']

In [19]:
df[cols_list_2]

   runs  balls
0    15     10
1    23     20
2    47     17

In [22]:
df.players

0     Krunal
1     Hardik
2    Pollard
Name: players, dtype: object

In [25]:
list(df.players)[2]

'Pollard'

In [23]:
type(df.players)

pandas.core.series.Series

In [ ]:
# df.iloc, df.loc,

In [27]:
df

   players  runs  balls
0   Krunal    15     10
1   Hardik    23     20
2  Pollard    47     17

In [26]:
df.iloc[0, 0]

'Krunal'

In [28]:
df.iloc[0, 1]

15

In [33]:
df[(df.players == 'Krunal')].balls

0    10
Name: balls, dtype: int64